{
  "type": "MONSTER",
  "name": "Dragon, Red",
  "description": "Dragons are vicious, reptilian beasts mainly found in rugged mountainous areas, where they build their dens in deep caves or abandoned dwarven mines. They are ancient beings of power and magic who consider themselves the true masters of the world. Dragons are cunning and often frighteningly eloquent, notorious for deceiving their victims with fair words and treacherous lies. On the other hand, they are as vain as peacocks and themselves susceptible to silver-tongued flattery. Another weakness is their attraction to gold, which often causes conflicts with dwarves, humans, and others who share the draconic lust for treasure and glittering objects.",
  "morale": 12,
  "ferocity": 3,
  "size": "HUGE",
  "move": 12,
  "hp": 84,
  "armor": 6,
  "resistance": "All piercing damage is halved (rounded up).",
  "immunity": "Immune to fear and PERSUASION.",
  "weakness": "Red dragons have a weakness to cold temperatures. All cold damage ignores armor.",
  "tags": [
    "dragon",
    "fire"
  ],
  "skills": [
    {
      "name": "Spot Hidden",
      "level": 10
    },
    {
      "name": "Evade",
      "level": 6
    },
    {
      "name": "Awareness",
      "level": 18
    },
    {
      "name": "Myths & Legends",
      "level": 14
    },
    {
      "name": "Hunting & Fishing",
      "level": 12
    }
  ],
  "effects": [
    {
      "name": "Wings",
      "description": "The mighty wings of the dragon allow it to move freely through the air."
    },
    {
      "name": "Persuadable",
      "description": "Unlike other monsters, ghosts can usually be PERSUADED, albeit with a bane on the roll"
    }
  ],
  "attacks": [
    {
      "result": "1",
      "name": "Dragon Wind",
      "description": "The dragon flaps its great wings and creates a powerful gale that strikes all adventurers within 10 meters. Any loose objects and creatures of up to human size in the whirlwind are hurled 2D6 meters, take the same amount of bludgeoning damage, and land prone."
    },
    {
      "result": "2",
      "name": "Fiery Breath",
      "description": "The dragon exhales a cone of fire, dealing 10D6 fire damage to all targets in range."
    },
    {
      "result": "3",
      "name": "Tail Sweep",
      "description": "The dragon swings its tail in a wide arc, dealing 2D10 bludgeoning damage to anyone behind it."
    },
    {
      "result": "4",
      "name": "Claw Swipe",
      "description": "A vicious swipe with its claws, dealing 2D8 slashing damage."
    },
    {
      "result": "5",
      "name": "Bite",
      "description": "A powerful bite that deals 3D8 piercing damage and has a chance to knock the target prone."
    },
    {
      "result": "6",
      "name": "Roar",
      "description": "The dragon roars, causing all enemies within 20 meters to make a fear check or become frightened for 1 round."
    }
  ]
}
